<template>
  <div class="v-service-page">
    <div v-for="service in services" :key="service" style="display: inline-block;">
      <router-link :to="{path: service.route}">
        <Card
          :img="service.src"
          :desc="service.desc"
          :name="service.name"
        />
      </router-link>
    </div>
  </div>
</template>

<script>
import Card from '@/components/v-service-card.vue'
export default {
  name: 'v-service-page',
  props: {
  },
  components: {
    Card
  },
  data() {
    return {
      services: [
        {
          name: 'Гастроэнтеролог', 
          desc: 'Врач-гастроэнтеролог поможет вовремя распознать начало течения болезни, даст рекомендации для быстрого снятия неприятных симптомов и подберет индивидуальную схему лечения.', 
          src: 'service.jpg',
          route: '/service-page/gastr'
        },
        {
          name: 'Гинеколог', 
          desc: 'Врач-акушер-гинеколог – специалист с высшим медицинским образованием, который занимается наблюдением состояния репродуктивной системы женщины, лечением возможных заболеваний и профилактикой осложнений.', 
          src: 'service.jpg',
          route: '/service-page/ginecolog'
        },
        {
          name: 'Кардиолог', 
          desc: 'Кардиолог - врач, специализирующийся на диагностике, лечении и профилактике сердечно-сосудистых заболеваний.', 
          src: 'service.jpg',
          route: '/service-page/cardiolog'
        },
        {
          name: 'ЛОР', 
          desc: 'ЛОР-врач (оториноларинголог) – это узкопрофильный специалист, занимающийся профилактикой, диагностикой и лечением патологии органов слуха, обоняния, глотки, гортани и трахеи («ухо/горло/нос»), а также прилегающих к ним областей.', 
          src: 'service.jpg',
          route: '/service-page/lor'
        },
        {
          name: 'Невролог', 
          desc: 'Врач-невролог (невропатолог) – специалист с высшим медицинским образованием, в компетенцию которого входит диагностика, лечение и профилактика болезней, связанных с нервной системой. Это центральная и периферическая нервная системы.', 
          src: 'service.jpg',
          route: '/service-page/nevrolog'
        },
        {
          name: 'Онколог', 
          desc: 'Врач-онколог занимается диагностикой, лечением опухолей, а также изучением преобразования доброкачественных опухолей в злокачественные.', 
          src: 'service.jpg',
          route: '/service-page/onkolog'
        },
        {
          name: 'Офтальмолог', 
          desc: 'Врач-офтальмолог – специалист с высшим медицинским образованием, который специализируется на диагностике, лечении и профилактике глазных заболеваний.', 
          src: 'service.jpg',
          route: '/service-page/oftalmolog'
        },
        {
          name: 'Терапевт', 
          desc: 'Терапевты являются первым звеном, способным помочь решить любые проблемы со здоровьем: назначить диагностику и лечение, направить к узким специалистам, помочь с госпитализацией.', 
          src: 'service.jpg',
          route: '/service-page/terapevt'
        },
        {
          name: 'Уролог', 
          desc: 'Это специалист, занимающийся диагностикой и лечением заболеваний органов мочевыделительной системы у женщин и мужчин, а также коррекцией нарушений мужской половой сферы.', 
          src: 'service.jpg',
          route: '/service-page/urolog'
        },
        {
          name: 'Хирург', 
          desc: 'В медицинской практике существует категория заболеваний, при которых наиболее эффективными являются хирургические методы лечения, данные вопросы находятся в компетенции врача — хирурга.', 
          src: 'service.jpg',
          route: '/service-page/hirurg'
        },
        {
          name: 'Эндокринолог', 
          desc: 'Нарушение работы щитовидной железы и нарушение обмена углеводов — самые известные проблемы, с которыми обращаются к врачу-эндокринологу.', 
          src: 'service.jpg',
          route: '/service-page/endocrinolog'
        },
        {
          name: 'Медицинские комиссии', 
          desc: 'Все виды медицинских комиссий, которые вы можете пройти в Клинике Здоровья', 
          src: 'service.jpg',
          route: '/service-page/medcom'
        },
        {
          name: 'Процедурный кабинет', 
          desc: 'Услуги, оказываемые в процедурном кабинете', 
          src: 'service.jpg',
          route: '/service-page/procedures'
        },
        {
          name: 'Рентген', 
          desc: 'Прайс-лист Рентгенологического кабинета', 
          src: 'service.jpg',
          route: '/service-page/rentgen'
        },
        {
          name: 'УЗИ', 
          desc: 'Прайс на услуги УЗИ-кабинета', 
          src: 'service.jpg',
          route: '/service-page/gastr'
        },
        {
          name: 'Анализы', 
          desc: 'Прайс на анализы', 
          src: 'service.jpg',
          route: '/service-page/gastr'
        },
      ]
    }
  }
}
</script>

<style>
</style>
