<template>
<div class="v-service">
  <div class="service-about">
    <div v-for="item in analysis_list" :key="item">
      <div class="service-header analysis">
        {{ item.name }}
      </div>
      <div v-for="analysis_group in item.analysis_groups" :key="analysis_group">
        <div class="service-header mini">
          {{ analysis_group.name }}
        </div>
        <div class="price-table">
        <div class="price-line"></div>
        <div v-for="analys in analysis_group.analysis" :key="analys">
            <div :class="analysis_group.size">
              <div class="price-name">
                {{ analys.name }}
              </div>
              <div class="price-price">
                {{ analys.price }}
              </div>
            </div>
            <div class="price-line"></div>
        </div>
      </div>
      </div>
    </div>
  </div>
</div>
</template>

<script>
export default {
    name: 'v-analysis',
    props: {
    },
    data() {
        return {
          analysis_list: [
            {
              name: 'Исследования крови',
              analysis_groups: [
                {
                  name: 'Общеклинические исследования крови',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Общий клинический анализ крови, лейкоцитарная формула, СОЭ',
                      price: '300 руб'
                    },
                    {
                      name: 'Общий  клинический анализ крови (без ЛФ)',
                      price: '180 руб'
                    },
                    {
                      name: 'Общий  клинический анализ крови (без ЛФ, с СОЭ)',
                      price: '200 руб'
                    },
                    {
                      name: 'Лейкоцитарная формула (ЛФ) (микроскопия)',
                      price: '150 руб'
                    },
                    {
                      name: 'СОЭ',
                      price: '100 руб'
                    },
                    {
                      name: 'Ретикулоциты',
                      price: '100 руб'
                    },
                    {
                      name: 'LE-клетки',
                      price: '200 руб'
                    },
                    {
                      name: 'Базофильная зернистость эритроцитов',
                      price: '120 руб'
                    },
                  ]
                },
                {
                  name: 'Иммуногематология',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Группа крови',
                      price: '250 руб'
                    },
                    {
                      name: 'Резус-фактор (Rh)',
                      price: '250 руб'
                    },
                    {
                      name: 'АТ к резус-фактору',
                      price: '400 руб'
                    },
                    {
                      name: 'Исследование АТ к антигенам эритроцитов в сыворотке крови  ',
                      price: '650 руб'
                    },
                  ]
                }
              ]
            },
            {
              name: 'Исследования системы гемостаза',
              analysis_groups: [
                {
                  name: 'Коагулограмма. Исследование гемостаза',
                  size: 'price-row lor-analysis',
                  analysis: [
                    {
                      name: 'Коагулограмма: АЧТВ; Протромбиновое время + МНО; Тромбиновое время; Фибриноген; Антитромбин III; (комплекс)',
                      price: '1 650 руб'
                    },
                    {
                      name: 'Протромбиновое время',
                      price: '250 руб'
                    },
                    {
                      name: 'Протромбиновый индекс (ПТИ)',
                      price: '250 руб'
                    },
                    {
                      name: 'МНО',
                      price: '250 руб'
                    },
                    {
                      name: 'АЧТВ',
                      price: '250 руб'
                    },
                    {
                      name: 'Тромбиновое время',
                      price: '250 руб'
                    },
                    {
                      name: 'Фибриноген',
                      price: '250 руб'
                    },
                    {
                      name: 'Антитромбин III',
                      price: '650 руб'
                    },
                    {
                      name: 'Протеин С',
                      price: '1 000 руб'
                    },
                    {
                      name: 'D-Димер',
                      price: '650 руб'
                    },
                    {
                      name: 'Волчаночный антикоагулянт',
                      price: '800 руб'
                    },
                    {
                      name: 'Подтверждающий тест с ядом гадюки Рассела',
                      price: '800 руб'
                    },
                    {
                      name: 'Концентрация плазминогена',
                      price: '600 руб'
                    },
                    {
                      name: 'РФМК',
                      price: '250 руб'
                    },
                    {
                      name: 'Фактор Виллебранда',
                      price: '1 500 руб'
                    },
                    {
                      name: '"ЭЛИ-АФС-ХГЧ-Тест-6" (антифосфолипидный синдром, анти-ХГЧ синдром, состояние имунной системы) понедельник, среда, пятница ЦЛД',
                      price: '1 700 руб'
                    },
                  ]
                },
                {
                  name: 'Агрегатограмма',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Агрегация тромбоцитов, индуцированная адреналином (2,5 мкг/мл)',
                      price: '300 руб'
                    },
                    {
                      name: 'Агрегация тромбоцитов, индуцированная адреналином (5,0 мкг/мл)',
                      price: '300 руб'
                    },
                    {
                      name: 'Агрегация тромбоцитов, индуцированная АДФ (2,5 мкг/мл)',
                      price: '250 руб'
                    },
                    {
                      name: 'Агрегация тромбоцитов, индуцированная АДФ (5,0 мкг/мл)',
                      price: '250 руб'
                    },
                    {
                      name: 'Агрегация тромбоцитов, индуцированная коллагеном (20,0 мкг/мл)',
                      price: '250 руб'
                    },
                    {
                      name: 'Агрегация тромбоцитов, индуцированная ристомицином (15,0 мкг/мл)',
                      price: '380 руб'
                    },
                  ]
                }
              ]
            },
            {
              name: 'Гормоны',
              analysis_groups: [
                {
                  name: 'Тиреоидная панель',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'ТТГ (Тиреотропный гормон) ',
                      price: '300 руб'
                    },
                    {
                      name: 'Т4 (Тироксин) общий',
                      price: '300 руб'
                    },
                    {
                      name: 'Т4 (Тироксин) свободный',
                      price: '300 руб'
                    },
                    {
                      name: 'Т3 (Трийодтиронин) общий',
                      price: '300 руб'
                    },
                    {
                      name: 'Т3 (Трийодтиронин) свободный',
                      price: '300 руб'
                    },
                    {
                      name: 'ТГ (Тиреоглобулин)',
                      price: '450 руб'
                    },
                    {
                      name: 'Тироксин-связывающая способность сыворотки (Т - Uptake)',
                      price: '650 руб'
                    },
                    {
                      name: 'Кальцитонин',
                      price: '800 руб'
                    },
                    {
                      name: 'Прокальцитонин',
                      price: '1 400 руб'
                    },
                  ]
                },
                {
                  name: 'Фертильность и репродукция',
                  size: 'price-row lor-analysis',
                  analysis: [
                    {
                      name: 'ЛГ (Лютеинезирующий гормон)',
                      price: '320 руб'
                    },
                    {
                      name: 'ФСГ (Фолликулостимулирующий гормон)',
                      price: '320 руб'
                    },
                    {
                      name: 'Эстрадиол',
                      price: '320 руб'
                    },
                    {
                      name: 'Тестостерон',
                      price: '320 руб'
                    },
                    {
                      name: 'Свободный тестостерон',
                      price: '700 руб'
                    },
                    {
                      name: 'Пролактин',
                      price: '320 руб'
                    },
                    {
                      name: 'Пролактин с определением макропролактина ',
                      price: '500 руб'
                    },
                    {
                      name: 'ГСПГ (Глобулин, связывающий половые гормоны)',
                      price: '400 руб'
                    },
                    {
                      name: 'Прогестерон',
                      price: '320 руб'
                    },
                    {
                      name: 'Дигидротестостерон',
                      price: '1000 руб'
                    },
                    {
                      name: '17-ОН-прогестерон',
                      price: '350 руб'
                    },
                    {
                      name: 'АМГ (Антимюллеров гормон) ',
                      price: '1 500 руб'
                    },
                    {
                      name: 'Ингибин В  ',
                      price: '1 500 руб'
                    },
                    {
                      name: 'Ингибин А',
                      price: '1 950 руб'
                    },
                    {
                      name: 'Эстриол свободный',
                      price: '350 руб'
                    },
                    {
                      name: 'бета- ХГЧ общий (бета-субъединица хорионического гонадотропина человека)',
                      price: '380 руб'
                    },
                    {
                      name: 'бета - ХГЧ свободный (бета-субъединица хорионического гонадотропина человека)',
                      price: '500 руб'
                    },
                    {
                      name: 'бета- ХГЧ общий (моча)',
                      price: '300 руб'
                    },
                    {
                      name: 'Плацентарный лактоген  ',
                      price: '500 руб'
                    },
                    {
                      name: 'LHCGR(rs2293275 C/T) Рецептор лютеинизирубщего гормона/хориогонадотропина (понедельник, среда, пятница в ЦЛД)',
                      price: '350 руб'
                    },
                  ]
                },
                {
                  name: 'Гормоны надпочечников',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Альдостерон',
                      price: '600 руб'
                    },
                    {
                      name: 'Кортизол',
                      price: '380 руб'
                    },
                    {
                      name: 'Кортизол в слюне',
                      price: '800 руб'
                    },
                    {
                      name: 'Свободный кортизол в суточной моче (указать рост, вес, V суточный)',
                      price: '900 руб'
                    },
                    {
                      name: 'ДГЭАС (Дегидроэпиандростерон сульфат) ',
                      price: '380 руб'
                    },
                    {
                      name: 'Андростендион',
                      price: '900 руб'
                    },
                  ]
                },
                {
                  name: 'Гормоны гипофиза',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Соматотропный гормон (СТГ)',
                      price: '450 руб'
                    },
                    {
                      name: 'АКТГ (Адренокортикотропный гормон ) ',
                      price: '800 руб'
                    },
                  ]
                },
                {
                  name: 'Гормоны поджелудочной железы',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Инсулин',
                      price: '400 руб'
                    },
                    {
                      name: 'С-пептид',
                      price: '400 руб'
                    },
                    {
                      name: 'Проинсулин',
                      price: '800 руб'
                    },
                    {
                      name: 'Индекс HOMA-IR (инсулин, глюкоза, рассчет инсулинорезистентности)',
                      price: '500 руб'
                    },
                  ]
                },
                {
                  name: 'Другие гормоны',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Гастрин',
                      price: '700 руб'
                    },
                    {
                      name: 'Инсулиноподобный фактор роста I (Соматомедин С)',
                      price: '600 руб'
                    },
                    {
                      name: 'Паратгормон',
                      price: '600 руб'
                    },
                    {
                      name: 'Лептин',
                      price: '750 руб'
                    },
                    {
                      name: 'Ренин',
                      price: '900 руб'
                    },
                    {
                      name: 'Эритропоэтин',
                      price: '500 руб'
                    },
                    {
                      name: 'Мелатонин',
                      price: '2 700 руб'
                    },
                  ]
                },
                {
                  name: 'Лекарственный мониторинг',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Вальпроевая кислота (кровь)  ',
                      price: '1 200 руб'
                    },
                  ]
                },
              ]
            }
          ]
        }
    }
}
</script>

<style>
.analysis {
  text-align: center; 
  margin-top: 40px; 
  margin-bottom: 20px;
}
.mini {
  font-size: 28px;
  opacity: 0.7;
  margin-left: 70px;
}
@media screen and (max-width: 700px) {
    .mini {
      font-size: 20px;
      margin-left: 20px;
    }
}
</style>
