<template>
<div class="v-service">
  <div class="service-about">
    <div v-for="item in analysis_list" :key="item">
      <div class="service-header analysis">
        {{ item.name }}
      </div>
      <div v-for="analysis_group in item.analysis_groups" :key="analysis_group">
        <div class="service-header mini">
          {{ analysis_group.name }}
        </div>
        <div class="price-table">
        <div class="price-line"></div>
        <div v-for="analys in analysis_group.analysis" :key="analys">
            <div :class="analysis_group.size">
              <div class="price-name">
                {{ analys.name }}
              </div>
              <div class="price-price">
                {{ analys.price }}
              </div>
            </div>
            <div class="price-line"></div>
        </div>
      </div>
      </div>
    </div>
  </div>
</div>
</template>

<script>
export default {
    name: 'v-analysis',
    props: {
    },
    data() {
        return {
          analysis_list: [
            {
              name: 'Исследования крови',
              analysis_groups: [
                {
                  name: 'Общеклинические исследования крови',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Общий клинический анализ крови, лейкоцитарная формула, СОЭ',
                      price: '300 руб'
                    },
                    {
                      name: 'Общий  клинический анализ крови (без ЛФ)',
                      price: '180 руб'
                    },
                    {
                      name: 'Общий  клинический анализ крови (без ЛФ, с СОЭ)',
                      price: '200 руб'
                    },
                    {
                      name: 'Лейкоцитарная формула (ЛФ) (микроскопия)',
                      price: '150 руб'
                    },
                    {
                      name: 'СОЭ',
                      price: '100 руб'
                    },
                    {
                      name: 'Ретикулоциты',
                      price: '100 руб'
                    },
                    {
                      name: 'LE-клетки',
                      price: '200 руб'
                    },
                    {
                      name: 'Базофильная зернистость эритроцитов',
                      price: '120 руб'
                    },
                  ]
                },
                {
                  name: 'Иммуногематология',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Группа крови',
                      price: '250 руб'
                    },
                    {
                      name: 'Резус-фактор (Rh)',
                      price: '250 руб'
                    },
                    {
                      name: 'АТ к резус-фактору',
                      price: '400 руб'
                    },
                    {
                      name: 'Исследование АТ к антигенам эритроцитов в сыворотке крови  ',
                      price: '650 руб'
                    },
                  ]
                }
              ]
            },
            {
              name: 'Исследования системы гемостаза',
              analysis_groups: [
                {
                  name: 'Коагулограмма. Исследование гемостаза',
                  size: 'price-row lor-analysis',
                  analysis: [
                    {
                      name: 'Коагулограмма: АЧТВ; Протромбиновое время + МНО; Тромбиновое время; Фибриноген; Антитромбин III; (комплекс)',
                      price: '1 650 руб'
                    },
                    {
                      name: 'Протромбиновое время',
                      price: '250 руб'
                    },
                    {
                      name: 'Протромбиновый индекс (ПТИ)',
                      price: '250 руб'
                    },
                    {
                      name: 'МНО',
                      price: '250 руб'
                    },
                    {
                      name: 'АЧТВ',
                      price: '250 руб'
                    },
                    {
                      name: 'Тромбиновое время',
                      price: '250 руб'
                    },
                    {
                      name: 'Фибриноген',
                      price: '250 руб'
                    },
                    {
                      name: 'Антитромбин III',
                      price: '650 руб'
                    },
                    {
                      name: 'Протеин С',
                      price: '1 000 руб'
                    },
                    {
                      name: 'D-Димер',
                      price: '650 руб'
                    },
                    {
                      name: 'Волчаночный антикоагулянт',
                      price: '800 руб'
                    },
                    {
                      name: 'Подтверждающий тест с ядом гадюки Рассела',
                      price: '800 руб'
                    },
                    {
                      name: 'Концентрация плазминогена',
                      price: '600 руб'
                    },
                    {
                      name: 'РФМК',
                      price: '250 руб'
                    },
                    {
                      name: 'Фактор Виллебранда',
                      price: '1 500 руб'
                    },
                    {
                      name: '"ЭЛИ-АФС-ХГЧ-Тест-6" (антифосфолипидный синдром, анти-ХГЧ синдром, состояние имунной системы) понедельник, среда, пятница ЦЛД',
                      price: '1 700 руб'
                    },
                  ]
                },
                {
                  name: 'Агрегатограмма',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Агрегация тромбоцитов, индуцированная адреналином (2,5 мкг/мл)',
                      price: '300 руб'
                    },
                    {
                      name: 'Агрегация тромбоцитов, индуцированная адреналином (5,0 мкг/мл)',
                      price: '300 руб'
                    },
                    {
                      name: 'Агрегация тромбоцитов, индуцированная АДФ (2,5 мкг/мл)',
                      price: '250 руб'
                    },
                    {
                      name: 'Агрегация тромбоцитов, индуцированная АДФ (5,0 мкг/мл)',
                      price: '250 руб'
                    },
                    {
                      name: 'Агрегация тромбоцитов, индуцированная коллагеном (20,0 мкг/мл)',
                      price: '250 руб'
                    },
                    {
                      name: 'Агрегация тромбоцитов, индуцированная ристомицином (15,0 мкг/мл)',
                      price: '380 руб'
                    },
                  ]
                }
              ]
            },
            {
              name: 'Гормоны',
              analysis_groups: [
                {
                  name: 'Тиреоидная панель',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'ТТГ (Тиреотропный гормон) ',
                      price: '300 руб'
                    },
                    {
                      name: 'Т4 (Тироксин) общий',
                      price: '300 руб'
                    },
                    {
                      name: 'Т4 (Тироксин) свободный',
                      price: '300 руб'
                    },
                    {
                      name: 'Т3 (Трийодтиронин) общий',
                      price: '300 руб'
                    },
                    {
                      name: 'Т3 (Трийодтиронин) свободный',
                      price: '300 руб'
                    },
                    {
                      name: 'ТГ (Тиреоглобулин)',
                      price: '450 руб'
                    },
                    {
                      name: 'Тироксин-связывающая способность сыворотки (Т - Uptake)',
                      price: '650 руб'
                    },
                    {
                      name: 'Кальцитонин',
                      price: '800 руб'
                    },
                    {
                      name: 'Прокальцитонин',
                      price: '1 400 руб'
                    },
                  ]
                },
                {
                  name: 'Фертильность и репродукция',
                  size: 'price-row lor-analysis',
                  analysis: [
                    {
                      name: 'ЛГ (Лютеинезирующий гормон)',
                      price: '320 руб'
                    },
                    {
                      name: 'ФСГ (Фолликулостимулирующий гормон)',
                      price: '320 руб'
                    },
                    {
                      name: 'Эстрадиол',
                      price: '320 руб'
                    },
                    {
                      name: 'Тестостерон',
                      price: '320 руб'
                    },
                    {
                      name: 'Свободный тестостерон',
                      price: '700 руб'
                    },
                    {
                      name: 'Пролактин',
                      price: '320 руб'
                    },
                    {
                      name: 'Пролактин с определением макропролактина ',
                      price: '500 руб'
                    },
                    {
                      name: 'ГСПГ (Глобулин, связывающий половые гормоны)',
                      price: '400 руб'
                    },
                    {
                      name: 'Прогестерон',
                      price: '320 руб'
                    },
                    {
                      name: 'Дигидротестостерон',
                      price: '1000 руб'
                    },
                    {
                      name: '17-ОН-прогестерон',
                      price: '350 руб'
                    },
                    {
                      name: 'АМГ (Антимюллеров гормон) ',
                      price: '1 500 руб'
                    },
                    {
                      name: 'Ингибин В  ',
                      price: '1 500 руб'
                    },
                    {
                      name: 'Ингибин А',
                      price: '1 950 руб'
                    },
                    {
                      name: 'Эстриол свободный',
                      price: '350 руб'
                    },
                    {
                      name: 'бета- ХГЧ общий (бета-субъединица хорионического гонадотропина человека)',
                      price: '380 руб'
                    },
                    {
                      name: 'бета - ХГЧ свободный (бета-субъединица хорионического гонадотропина человека)',
                      price: '500 руб'
                    },
                    {
                      name: 'бета- ХГЧ общий (моча)',
                      price: '300 руб'
                    },
                    {
                      name: 'Плацентарный лактоген  ',
                      price: '500 руб'
                    },
                    {
                      name: 'LHCGR(rs2293275 C/T) Рецептор лютеинизирубщего гормона/хориогонадотропина (понедельник, среда, пятница в ЦЛД)',
                      price: '350 руб'
                    },
                  ]
                },
                {
                  name: 'Гормоны надпочечников',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Альдостерон',
                      price: '600 руб'
                    },
                    {
                      name: 'Кортизол',
                      price: '380 руб'
                    },
                    {
                      name: 'Кортизол в слюне',
                      price: '800 руб'
                    },
                    {
                      name: 'Свободный кортизол в суточной моче (указать рост, вес, V суточный)',
                      price: '900 руб'
                    },
                    {
                      name: 'ДГЭАС (Дегидроэпиандростерон сульфат) ',
                      price: '380 руб'
                    },
                    {
                      name: 'Андростендион',
                      price: '900 руб'
                    },
                  ]
                },
                {
                  name: 'Гормоны гипофиза',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Соматотропный гормон (СТГ)',
                      price: '450 руб'
                    },
                    {
                      name: 'АКТГ (Адренокортикотропный гормон ) ',
                      price: '800 руб'
                    },
                  ]
                },
                {
                  name: 'Гормоны поджелудочной железы',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Инсулин',
                      price: '400 руб'
                    },
                    {
                      name: 'С-пептид',
                      price: '400 руб'
                    },
                    {
                      name: 'Проинсулин',
                      price: '800 руб'
                    },
                    {
                      name: 'Индекс HOMA-IR (инсулин, глюкоза, рассчет инсулинорезистентности)',
                      price: '500 руб'
                    },
                  ]
                },
                {
                  name: 'Другие гормоны',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Гастрин',
                      price: '700 руб'
                    },
                    {
                      name: 'Инсулиноподобный фактор роста I (Соматомедин С)',
                      price: '600 руб'
                    },
                    {
                      name: 'Паратгормон',
                      price: '600 руб'
                    },
                    {
                      name: 'Лептин',
                      price: '750 руб'
                    },
                    {
                      name: 'Ренин',
                      price: '900 руб'
                    },
                    {
                      name: 'Эритропоэтин',
                      price: '500 руб'
                    },
                    {
                      name: 'Мелатонин',
                      price: '2 700 руб'
                    },
                  ]
                },
                {
                  name: 'Лекарственный мониторинг',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Вальпроевая кислота (кровь)  ',
                      price: '1 200 руб'
                    },
                  ]
                },
              ]
            },
            {
              name: 'Аутоиммунные заболевания',
              analysis_groups: [
                {
                  name: '',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'АТ к тиреоглобулину (АТ к ТГ)',
                      price: '400 руб'
                    },
                    {
                      name: 'АТ к тиреоидной пероксидазе (АТ к ТПО)',
                      price: '500 руб'
                    },
                    {
                      name: 'АТ к рецепторам ТТГ (тиреотропного гормона) ',
                      price: '1 200 руб'
                    },
                    {
                      name: 'АТ к ядерным антигенам (ANA) (кач.)',
                      price: '550 руб'
                    },
                    {
                      name: 'АТ к фосфолипидам lgG; lgM',
                      price: '900 руб'
                    },
                    {
                      name: 'АТ к митохондриям (АМА)  ',
                      price: '900 руб'
                    },
                    {
                      name: 'АТ к инсулину',
                      price: '750 руб'
                    },
                    {
                      name: 'АТ к β-клеткам поджелудочной железы  ',
                      price: '1 300 руб'
                    },
                    {
                      name: 'АТ к гладкой мускулатуре  ',
                      price: '1 300 руб'
                    },
                    {
                      name: 'АТ к париентальным клеткам желудка  ',
                      price: '1 400 руб'
                    },
                    {
                      name: 'АТ к микросомам печени и почек (Аnti - LKM1)  ',
                      price: '1 300 руб'
                    },
                    {
                      name: 'АТ к миокарду  ',
                      price: '1 400 руб'
                    },
                    {
                      name: 'АТ к кардиолипину (IgA + IgM + IgG)',
                      price: '1 000 руб'
                    },
                    {
                      name: 'АТ к кардиолипину (IgA) количественно  ',
                      price: '1 000 руб'
                    },
                    {
                      name: 'АТ к кардиолипину (IgG) количественно  ',
                      price: '1 000 руб'
                    },
                    {
                      name: 'АТ к β-2 Гликопротеину I (IgG + IgA + IgM)  ',
                      price: '1 000 руб'
                    },
                    {
                      name: 'АТ к тканевой трансглутаминазе IgG   ',
                      price: '1 300 руб'
                    },
                    {
                      name: 'АТ к тканевой трансглутаминазе IgА   ',
                      price: '1 300 руб'
                    },
                    {
                      name: 'АТ к нативной ДНК',
                      price: '650 руб'
                    },
                    {
                      name: 'АТ к микросомальной фракции тиреоцитов (АТ-МАГ)',
                      price: '600 руб'
                    },
                    {
                      name: 'Антитела к деамидированным пептидам глиадина IgA (диагностика целиакии)',
                      price: '750 руб'
                    },
                    {
                      name: 'Антитела к деамидированным пептидам глиадина Ig G (диагностика целиакии)',
                      price: '650 руб'
                    },
                    {
                      name: 'Антитела к виментину(АМЦВ) (диагностика ревматоидного артрита)  ',
                      price: '1 200 руб'
                    },
                    {
                      name: 'Антитела к тромбоцитам IgG  ',
                      price: '1 500 руб'
                    },
                    {
                      name: 'Комплекс маркеров аутоиммунного гепатита (IgG к AMA-M2 LKM-1 LC-1 SLA/LP)',
                      price: '1 250 руб'
                    },
                    {
                      name: 'Антиовариальные антитела',
                      price: '1 250 руб'
                    },
                    {
                      name: 'Антиспермальные антитела',
                      price: '800 руб'
                    },
                  ]
                }
              ]
            },
            {
              name: 'Онкомаркеры (Антигены)',
              analysis_groups: [
                {
                  name: '',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'АФП (Альфафетопротеин)',
                      price: '400 руб'
                    },
                    {
                      name: 'РЭА (Раковоэмбриональный антиген)',
                      price: '350 руб'
                    },
                    {
                      name: 'СА-19.9',
                      price: '400 руб'
                    },
                    {
                      name: 'СА-15.3',
                      price: '400 руб'
                    },
                    {
                      name: 'СА-242',
                      price: '1 200 руб'
                    },
                    {
                      name: 'Са-72.4',
                      price: '750 руб'
                    },
                    {
                      name: 'Cyfra-21-1',
                      price: '1 000 руб'
                    },
                    {
                      name: 'ФНО (Фактор некроза опухоли)',
                      price: '1 400 руб'
                    },
                    {
                      name: 'NSE (Нейрон-специфическая энолаза)',
                      price: '650 руб'
                    },
                    {
                      name: 'Бета-2-Микроглобулин',
                      price: '800 руб'
                    },
                    {
                      name: 'ПСА (простатспецифический антиген) общий',
                      price: '400 руб'
                    },
                    {
                      name: 'ПСА (простатспецифический антиген) свободный',
                      price: '400 руб'
                    },
                    {
                      name: 'ПСА общий + ПСА свободный',
                      price: '700 руб'
                    },
                    {
                      name: 'Белок S100',
                      price: '2 500 руб'
                    },
                    {
                      name: 'СА-125',
                      price: '450 руб'
                    },
                    {
                      name: 'HE4 (человеческий эпидидимальный секреторный белок 4)',
                      price: '1 300 руб'
                    },
                    {
                      name: 'Комплекс HE-4, СА-125, индекс риска рака яичников (ROMA 1, ROMA 2)',
                      price: '1 700 руб'
                    },
                  ]
                }
              ]
            },
            {
              name: 'Биохимические исследования крови',
              analysis_groups: [
                {
                  name: 'Специфические белки',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'АСЛ-О (Антистрептолизин-О)',
                      price: '400 руб'
                    },
                    {
                      name: 'Гаптоглобин',
                      price: '550 руб'
                    },
                    {
                      name: 'С-реактивный белок (ультрачувствительный)',
                      price: '350 руб'
                    },
                    {
                      name: 'Ревматоидный фактор',
                      price: '250 руб'
                    },
                    {
                      name: 'Преальбумин',
                      price: '1 500 руб'
                    },
                    {
                      name: 'Церулоплазмин',
                      price: '600 руб'
                    },
                    {
                      name: 'Фруктозамин',
                      price: '400 руб'
                    },
                    {
                      name: 'Катионный протеин эозинофилов',
                      price: '700 руб'
                    },
                  ]
                },
                {
                  name: 'Витамины',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'В-12 (Цианокобаламин)',
                      price: '500 руб'
                    },
                    {
                      name: 'Витамин B1 (Тиамин)',
                      price: '2 000 руб'
                    },
                    {
                      name: 'Витамин B6 (Пиридоксин)',
                      price: '2 000 руб'
                    },
                    {
                      name: '25-ОН Витамин D',
                      price: '1 500 руб'
                    },
                    {
                      name: 'Фолиевая кислота',
                      price: '450 руб'
                    },
                  ]
                },
                {
                  name: 'Ферменты',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'АЛТ (аланинаминотрансфераза',
                      price: '150 руб'
                    },
                    {
                      name: 'АСТ (аспартатаминотрансфераза)',
                      price: '150 руб'
                    },
                    {
                      name: 'Альфа-амилаза',
                      price: '170 руб'
                    },
                    {
                      name: 'Амилаза панкреатическая',
                      price: '300 руб'
                    },
                    {
                      name: 'ГГТ (гаммаглутаматтранспептидаза)',
                      price: '150 руб'
                    },
                    {
                      name: 'Креатинкиназа (КК, Креатинфосфокиназа ) ',
                      price: '150 руб'
                    },
                    {
                      name: 'Креатинкиназа - МВ (КК-МВ, Креатинфосфокиназа - миокардиальная фракция)',
                      price: '170 руб'
                    },
                    {
                      name: 'Лактатдегидрогеназа (ЛДГ)',
                      price: '200 руб'
                    },
                    {
                      name: 'Липаза',
                      price: '150 руб'
                    },
                    {
                      name: 'Щелочная фосфатаза (ЩФ)',
                      price: '150 руб'
                    },
                    {
                      name: 'Холинэстераза сывороточная (ХЭ)',
                      price: '200 руб'
                    },
                    {
                      name: 'Пепсиноген I (Pepsinogen I) ',
                      price: '500 руб'
                    },
                    {
                      name: 'Пепсиноген II (Pepsinogen II) ',
                      price: '500 руб'
                    },
                  ]
                },
                {
                  name: 'Обмен пигментов',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Билирубин общий',
                      price: '150 руб'
                    },
                    {
                      name: 'Билирубин прямой',
                      price: '150 руб'
                    },
                  ]
                },
                {
                  name: 'Субстраты',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Креатинин',
                      price: '150 руб'
                    },
                    {
                      name: 'Мочевина',
                      price: '150 руб'
                    },
                    {
                      name: 'Мочевая кислота',
                      price: '150 руб'
                    },
                  ]
                },
                {
                  name: 'Функциональные тесты',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Проба Реберга (кровь + суточная моча, указать рост, вес, возраст)',
                      price: '300 руб'
                    },
                    {
                      name: 'СКФ (Скорость клубочковой фильтрации) (кровь, указать рост, вес, возраст)',
                      price: '180 руб'
                    },
                  ]
                },
                {
                  name: 'Обмен железа и диагностика анемий',
                  size: 'price-row',
                  analysis: [
                    {
                      name: 'Железо',
                      price: '150 руб'
                    },
                    {
                      name: 'Латентная железосвязывающая способность (ЛЖСС) ',
                      price: '150 руб'
                    },
                    {
                      name: 'Трансферрин',
                      price: '450 руб'
                    },
                    {
                      name: 'Углевод-дефицитный трансферрин, CDT ',
                      price: '2 600 руб'
                    },
                    {
                      name: 'Ферритин',
                      price: '450 руб'
                    },
                    {
                      name: 'Общая железосвязывающая способность (ОЖСС) + Индекс насыщения трансферрина',
                      price: '170 руб'
                    },
                  ]
                },
                                {
                  name: '',
                  size: '',
                  analysis: [
                    {
                      name: '',
                      price: ''
                    },
                  ]
                },
                                {
                  name: '',
                  size: '',
                  analysis: [
                    {
                      name: '',
                      price: ''
                    },
                  ]
                },
                                {
                  name: '',
                  size: '',
                  analysis: [
                    {
                      name: '',
                      price: ''
                    },
                  ]
                },
                                {
                  name: '',
                  size: '',
                  analysis: [
                    {
                      name: '',
                      price: ''
                    },
                  ]
                },
                                {
                  name: '',
                  size: '',
                  analysis: [
                    {
                      name: '',
                      price: ''
                    },
                  ]
                },
                                {
                  name: '',
                  size: '',
                  analysis: [
                    {
                      name: '',
                      price: ''
                    },
                  ]
                },
                                {
                  name: '',
                  size: '',
                  analysis: [
                    {
                      name: '',
                      price: ''
                    },
                  ]
                },
                                {
                  name: '',
                  size: '',
                  analysis: [
                    {
                      name: '',
                      price: ''
                    },
                  ]
                },
                                {
                  name: '',
                  size: '',
                  analysis: [
                    {
                      name: '',
                      price: ''
                    },
                  ]
                },
              ]
            }
          ]
        }
    }
}
</script>

<style>
.analysis {
  text-align: center; 
  margin-top: 40px; 
  margin-bottom: 20px;
}
.mini {
  font-size: 28px;
  opacity: 0.7;
  margin-left: 70px;
}
@media screen and (max-width: 700px) {
    .mini {
      font-size: 20px;
      margin-left: 20px;
    }
}
</style>
