<template>
  <div class="v-service">
    <div class="service-about">
        <div class="service-header">Хирург</div>
        <div class="service-text">В медицинской практике существует категория заболеваний, при которых наиболее эффективными являются хирургические методы лечения, данные вопросы находятся в компетенции врача — хирурга. При этом очень важно своевременно поставить диагноз, подобрать максимально безопасный метод хирургического вмешательства и позаботиться о здоровье в послеоперационный период.</div>
        <div class="service-text">Не все хирургические вмешательства требуют обязательной госпитализации в стационар, многие вмешательства можно выполнить на амбулаторном этапе. На амбулаторном приеме проводится диагностика и лечение заболеваний опорно-двигательного аппарата, периферической артериальной и венозной системы, гнойно-воспалительных заболеваний кожи и подкожной клетчатки.</div>
        <div class="service-text"><b>К хирургу следует обратиться, если вас беспокоят следующие симптомы:</b></div>
        <div class="service-text" style="text-align: left;">
            •	острые, очень сильные или длительные хронические боли;<br>
            •	боли после травм живота, груди;<br>
            •	наличие очагов гнойно-воспалительного поражения: отек, припухлость, покраснение, повышение температуры, боли;<br>
            •	выраженные нарушения пищеварения, отсутствие стула более 3 дней, когда не удается получить его при помощи клизмы;<br>
            •	примеси крови в кале, мокроте, рвотных массах;<br>
            •	острые боли в животе.<br>
        </div>
        <div class="service-header">Услуги врача-хирурга</div>
        <div class="price-table">
            <div class="price-line"></div>
            <div v-for="service in hirurg_services" :key="service">
                <div class="price-row">
                <div class="price-name">{{service.name}}</div>
                <div class="price-price">{{service.price}}</div>
                </div>
                <div class="price-line"></div>
            </div>
        </div>
        <div class="service-header">Процедуры и манипуляции</div>
        <div class="price-table">
            <div class="price-line"></div>
            <div v-for="service in hirurg_procedures" :key="service">
                <div class="price-row lor-analysis">
                <div class="price-name">{{service.name}}</div>
                <div class="price-price">{{service.price}}</div>
                </div>
                <div class="price-line"></div>
            </div>
        </div>
    </div>
  </div>
</template>

<script>
export default {
    name: 'v-gastr',
    props: {
    },
    mounted() {
        const meta = document.createElement("meta");
        meta.name = "description";
        meta.content = "Клиника здоровья хирург";
        document.body.appendChild(meta);
    },
    data() {
        return {
            hirurg_services: [
                {
                    name: 'Консультация хирурга первичная',
                    price: '2 200 руб'
                },
                {
                    name: 'Консультация хирурга повторная',
                    price: '2 000 руб'
                },
                {
                    name: 'Устная консультация',
                    price: '800 руб'
                },
            ],
            hirurg_procedures: [
                {
                    name: 'Перевязка после операции и/или снятие швов (для пациентов, оперированных в Клинике)',
                    price: '400 руб',
                },
                {
                    name: 'Перевязка гнойная малая',
                    price: '600 руб',
                },
                {
                    name: 'Перевязка гнойная большая',
                    price: '900 руб',
                },
                {
                    name: 'Удаление новообразований на голове и шее до 3 см.',
                    price: '3 000 руб',
                },
                {
                    name: 'Удаление новообразований на голове и шее больше 3 см.',
                    price: '5 000 руб',
                },
                {
                    name: 'Удаление новообразований на туловище и конечностях до 5 см.',
                    price: '2 000 руб',
                },
                {
                    name: 'Удаление новообразований на туловище и конечностях больше 5 см.',
                    price: '5 000 руб',
                },
                {
                    name: 'Удаление одиночных кожных образований (фибромы, себорейные кератомы, бородавки, кожный рог, пиогенные гранулемы) иссечение скальпелем',
                    price: '1 700 руб',
                },
                {
                    name: 'Удаление одиночных кожных образований (фибромы, себорейные кератомы, бородавки, кожный рог, пиогенные гранулемы) ДЭК 5шт',
                    price: '1 800 руб',
                },
                {
                    name: 'Удаление одиночных кожных образований (фибромы, себорейные кератомы, бородавки, кожный рог, пиогенные гранулемы) ДЭК 10 шт',
                    price: '2 200 руб',
                },
                {
                    name: 'Частичная резекция ногтевой пластины',
                    price: '1 500 руб',
                },
                {
                    name: 'Удаление ногтевой пластины',
                    price: '2 000 руб',
                },
                {
                    name: 'Пальцевое ректальное исследование',
                    price: '500 руб',
                },
                {
                    name: 'Различные блокады с введением лекарственных препаратов',
                    price: '1 000 руб',
                },
                {
                    name: 'Околосуставные, внутрисуставные пункции и пункции серомы (без стоимости лекарственных препаратов)',
                    price: '1 000 руб',
                },
                {
                    name: 'Биопсия кожи, мягких тканей, лимфатических узлов',
                    price: '800 руб',
                },
                {
                    name: 'Забор анализа (или материала)',
                    price: '300 руб',
                },
                {
                    name: 'Вскрытие абсцесса при нагноении копчикового хода',
                    price: '2 000 руб',
                },
                {
                    name: 'Вскрытие и дренирование абсцессов и гематом туловища',
                    price: '2 000 руб',
                },
                {
                    name: 'Вскрытие и дренирование гнойного постинъекционного абсцесса',
                    price: '2 000 руб',
                },
                {
                    name: 'Вскрытие и дренирование гнойного мастита',
                    price: '2 000 руб',
                },
                {
                    name: 'Вскрытие нагноившейся атеромы',
                    price: '1 300 руб',
                },
                {
                    name: 'Оперативное лечение кожного и подкожного панариция',
                    price: '1 500 руб',
                },
                {
                    name: 'Вскрытие абсцесса при подмышечном гидрадените',
                    price: '1 300 руб',
                },
                {
                    name: 'Иссечение лигатурного свища',
                    price: '1 500 руб',
                },
                {
                    name: 'Некрэктомия',
                    price: '1 000 руб',
                },
                {
                    name: 'Вскрытие и дренирование фурункула (малого размера)',
                    price: '1 500 руб',
                },
                {
                    name: 'Вскрытие и дренирование фурункула (большого размера)',
                    price: '2 000 руб',
                },
                {
                    name: 'Посев на микрофлору и определение чувствительности к антибиотикам отделяемого ран',
                    price: '470 руб',
                },
                {
                    name: 'Цитологическое исследование транссудатов; экссудатов; секретов; экскретов, в том числе мочи; отделяемого молочной железы, выпотных жидкостей; мокроты',
                    price: '500 руб',
                },
                {
                    name: 'Цитологическое исследование биоматериала из образования молочной железы: кожи, лимфатических узлов и других органов, полученных аспирационной пункцией тонкой иглой',
                    price: '500 руб',
                },
                {
                    name: 'Цитологическое исследование соскобов и отпечатков с поверхности (клеточный состав, бактериоскопия) кожи: барабанной перепонки, слизистых оболочек (миндалин. полости носа, гортани, бронхов, пищевода, желудка, кишки)',
                    price: '500 руб',
                },
                {
                    name: 'Гистологическое исследование биопсийного материала',
                    price: '1 600 руб',
                },
                {
                    name: 'ПХО 1-ой степени сложности',
                    price: '700 руб',
                },
                {
                    name: 'ПХО 2-й степени сложности',
                    price: '1 200 руб',
                },
                {
                    name: 'ПХО 3-й степени сложности',
                    price: '1 700 руб',
                },
                {
                    name: 'Удаление инородного тела мягких тканей',
                    price: '2 000 руб',
                },
                {
                    name: 'Иссечение анального полипа',
                    price: '7 000 руб',
                },
            ]
        }
    }
}
</script>

<style>
</style>
