<template>
  <div class="v-service">
    <div class="service-about">
      <div class="service-header">Онколог</div>
      <div class="service-text">Врач-онколог занимается диагностикой, лечением опухолей, а также изучением преобразования доброкачественных опухолей в злокачественные. Часто первичные стадии заболевания протекают бессимптомно, поэтому качественная и максимально ранняя диагностика является важным фактором при лечении онкологических заболеваний.</div>
      <div class="service-text">При подозрении на появление опухоли или ее симптомов, настоятельно рекомендуем, как можно раньше обратиться к профессиональному онкологу, так как ранняя диагностика и своевременное, адекватное лечение существенно повышают вероятность выздоровления и снижают риски осложнений при этих непростых диагнозах.</div>
      <div class="service-text"><b>Когда рекомендована консультация онколога?</b></div>
      <div class="service-text" style="text-align: left;">
•	хронические воспалительные процессы;<br>
•	появление уплотнений, образований под кожей или на коже;<br>
•	наличие уплотнений и узлов в молочной железе;<br>
•	увеличение лимфатических узлов в подмышечной области или на шее;<br>
•	темные и большие родинки;<br>
•	отягощенная наследственность;<br>
•	папилломы, бородавки;<br>
•	быстрое, ничем не объяснимое похудение;<br>
•	кровь в естественных выделениях организма (моча, кал);<br>
•	увеличение грудных желез у мужчин;<br>
•	профессиональная вредность.<br>
      </div>
        <div class="service-header">Услуги врача онколога</div>
        <div class="price-table">
            <div class="price-line"></div>
            <div v-for="service in onkolog_services" :key="service">
                <div class="price-row lor-analysis">
                <div class="price-name">{{service.name}}</div>
                <div class="price-price">{{service.price}}</div>
                </div>
                <div class="price-line"></div>
            </div>
        </div>
    </div>
  </div>
</template>

<script>
export default {
    name: 'v-gastr',
    props: {
    },
    mounted() {
        const meta = document.createElement("meta");
        meta.name = "description";
        meta.content = "Клиника здоровья онколог";
        document.body.appendChild(meta);
    },
    data() {
        return {
            onkolog_services: [
                {
                    name: 'Первичный прием',
                    price: '2 500 руб'
                },
                {
                    name: 'Повторный прием',
                    price: '2 200 руб'
                },
                {
                    name: 'Биопсия кожи, мягких тканей, лимфатических узлов',
                    price: '650 руб'
                },
                {
                    name: 'Пункция новообразования (без контроля ультразвукового исследования) БЕЗ СТОИМОСТИ АНАЛИЗА',
                    price: '1 500 руб'
                },
                {
                    name: 'Пункция новообразования (под контролем ультразвукового исследования) БЕЗ СТОИМОСТИ АНАЛИЗА',
                    price: '2 000 руб'
                },
                {
                    name: 'Перевязка',
                    price: '400 руб'
                },
                {
                    name: 'Контроль ультразвукового исследования после биопсии',
                    price: '500 руб'
                },
                {
                    name: 'Цитологическое исследование соскобов и отпечатков',
                    price: '700 руб'
                },
                {
                    name: 'Цитологическое исследование 1 предметное стекло',
                    price: '700 руб'
                },
                {
                    name: 'Цитологическое исследование 2 предметных стекла',
                    price: '1 400 руб'
                },
                {
                    name: 'Цитологическое исследование 3 предметных стекла',
                    price: '2 100 руб'
                },
                {
                    name: 'Цитологическое исследование 4 предметных стекла',
                    price: '2 900 руб'
                },
                {
                    name: 'Гистологическое исследование биоптатов и материалов',
                    price: '2 200 руб'
                },
                {
                    name: 'Удаление единичных доброкачественных новообразований до 1,5 см (одного элемента)',
                    price: '1 300 руб'
                },
                {
                    name: 'Удаление доброкачественных новообразований более 1,5 см (одного элемента)',
                    price: '2 000 руб'
                },
            ],
        }
    }
}
</script>

<style>
</style>
