<template>
  <div class="v-service">
    <div class="service-about">
        <div class="service-header">Прайс-лист рентгенологического кабинета</div>
        <div class="price-table">
            <div class="price-line"></div>
            <div v-for="service in rentgen_services" :key="service">
                <div class="price-row">
                <div class="price-name">{{service.name}}</div>
                <div class="price-price">{{service.price}}</div>
                </div>
                <div class="price-line"></div>
            </div>
        </div>
    </div>
  </div>
</template>

<script>
export default {
    name: 'v-gastr',
    props: {
    },
    mounted() {
        const meta = document.createElement("meta");
        meta.name = "description";
        meta.content = "Клиника здоровья рентген";
        document.body.appendChild(meta);
    },
    data() {
        return {
            rentgen_services: [
                {
                    name: 'Рентгенография легких (две проекции)',
                    price: '1 400 руб',
                },
                {
                    name: 'Рентгенография легких (одна проекция)',
                    price: '700 руб',
                },
                {
                    name: 'Рентгенография черепа в одной или более проекциях',
                    price: '1 000 руб',
                },
                {
                    name: 'Рентгенография костей лицевого скелета (две проекции)',
                    price: '800 руб',
                },
                {
                    name: 'Рентгенография височно-нижнечелюстного сустава (две проекции)',
                    price: '900 руб',
                },
                {
                    name: 'Рентгенография придаточных пазух носа (одна проекция)',
                    price: '700 руб',
                },
                {
                    name: 'Рентгенография нижней челюсти в боковой проекции',
                    price: '700 руб',
                },
                {
                    name: 'Рентгенография первого и второго шейного позвоночника (одна проекция)',
                    price: '700 руб',
                },
                {
                    name: 'Рентгенография шейного отдела позвоночника (две проекции)',
                    price: '1 200 руб',
                },
                {
                    name: 'Рентгенография грудного отдела позвоночника (две проекции)',
                    price: '1 500 руб',
                },
                {
                    name: 'Рентгенография поясничного отдела позвоночника (две проекции)',
                    price: '1 500 руб',
                },
                {
                    name: 'Рентгенография крестца и копчика (две проекции)',
                    price: '1 500 руб',
                },
                {
                    name: 'Рентгенография плечевой кости (две проекции)',
                    price: '1 100 руб',
                },
                {
                    name: 'Рентгенография локтевой кости и лучевой кости (костей предплечья, две проекции)',
                    price: '1 100 руб',
                },
                {
                    name: 'Рентгенография запястья (две проекции)',
                    price: '900 руб',
                },
                {
                    name: 'Рентгенография кисти (две проекции)',
                    price: '1 000 руб',
                },
                {
                    name: 'Рентгенография кисти (прямая проекция)',
                    price: '700 руб',
                },
                {
                    name: 'Рентгенография фаланг пальцев кисти (две проекции)',
                    price: '900 руб',
                },
                {
                    name: 'Рентгенография локтевого сустава (две проекции)',
                    price: '1 300 руб',
                },
                {
                    name: 'Рентгенография лучезапястного сустава (две проекции)',
                    price: '1 300 руб',
                },
                {
                    name: 'Рентгенография плечевого сустава (две проекции)',
                    price: '1 300 руб',
                },
                {
                    name: 'Рентгенография плечевого сустава (одна проекции)',
                    price: '900 руб',
                },
                {
                    name: 'Рентгенография акромиально-ключичного сочленения (две проекции)',
                    price: '900 руб',
                },
                {
                    name: 'Рентгенография ключицы (одна проекция)',
                    price: '1 200 руб',
                },
                {
                    name: 'Рентгенография нижней конечности (две проекции)',
                    price: '1 400 руб',
                },
                {
                    name: 'Рентгенография бедренной кости (две проекции)',
                    price: '1 400 руб',
                },
                {
                    name: 'Рентгенография таза (одна проекция)',
                    price: '700 руб',
                },
                {
                    name: 'Рентгенография большой берцовой и малой берцовой костей (костей голени, две проекции)',
                    price: '1 100 руб',
                },
                {
                    name: 'Рентгенография пяточной кости (одна кость две проекции, две кости одна проекция)',
                    price: '900 руб',
                },
                {
                    name: 'Рентгенография стопы в двух проекциях',
                    price: '900 руб',
                },
                {
                    name: 'Рентгенография стопы в двух проекциях (две стопы в двух проекциях)',
                    price: '2 000 руб',
                },
                {
                    name: 'Рентгенография стопы (две стопы в прямой проекции)',
                    price: '700 руб',
                },
                {
                    name: 'Рентгенография стопы (одна проекция)',
                    price: '700 руб',
                },
                {
                    name: 'Рентгенография коленного сустава (две проекции)',
                    price: '1 000 руб',
                },
                {
                    name: 'Рентгенография голеностопного сустава (две проекции)',
                    price: '900 руб',
                },
                {
                    name: 'Рентгенография тазобедренного сустава (один сустав в двух проекциях)',
                    price: '1 000 руб',
                },
                {
                    name: 'Рентгенография тазобедренного сустава (два сустава, прямая проекция)',
                    price: '700 руб',
                },
                {
                    name: 'Маммография',
                    price: '1 200 руб',
                },
                {
                    name: 'Маммография (одна молочная железа)',
                    price: '800 руб',
                },
                {
                    name: 'Обзорный снимок брюшной полости и органов малого таза (в том числе отсроченная)',
                    price: '900 руб',
                },
                {
                    name: 'Рентгеновский снимок в дополнительной проекции',
                    price: '300 руб',
                },
                {
                    name: 'Рентгенография одной области в одной проекции (не указанной в прайс-листе)',
                    price: '900 руб',
                },
                {
                    name: 'Описание и интерпретация рентгенографических изображений',
                    price: '300 руб',
                },
            ],
        }
    }
}
</script>

<style>
</style>
