<template>
  <div class="v-service">
    <div class="service-about">
        <div class="service-header">Подготовка к УЗИ</div>
        <div v-for="rule in usi_rules" :key="rule">
            <div class="service-text">
                <b> {{ rule.name }} </b>
            </div>
            <div class="service-text">
                {{ rule.text }}
            </div>
        </div>

        <div class="service-header">Прайс-лист УЗИ</div>
        <div class="price-table">
            <div class="price-line"></div>
            <div v-for="service in usi_services" :key="service">
                <div class="price-row">
                    <div class="price-name">
                        {{ service.name }}
                    </div>
                    <div class="price-price">
                        {{ service.price }}
                    </div>
                </div>
                <div class="price-line"></div>
            </div>
        </div>
    </div>
  </div>
</template>

<script>
export default {
    name: 'v-gastr',
    props: {
    },
    data() {
        return {
            usi_rules: [
                {
                    name: '1. УЗИ брюшной полости и почки',
                    text: 'За 3 дня до обследования исключить из рациона продукты, повышающие газообразование: черный хлеб, кисломолочные продукты, жирную пищу, сырые фрукты и овощи. Накануне самый поздний ужин до 19.00. в день обследования за 6 часов до обследования не кушать, за 4 часа не пить.'
                },
                {
                    name: '2. УЗИ брюшной полости, почки и мочевой пузырь',
                    text: 'За 3 дня до обследования исключить из рациона продукты, повышающие газообразование: черный хлеб, кисломолочные продукты, жирную пищу, сырые фрукты и овощи. Накануне самый поздний ужин до 19.00. в день обследования за 6 часов до обследования не кушать, за 4 часа – не пить и за 2 часа не мочиться. Если пациент принимает какие-то таблетки можно запить водой'
                },
                {
                    name: '3. УЗИ почек и мочевого пузыря',
                    text: 'За 1 час до обследования выпить 1 литр негазированной воды и не мочиться. При невозможности терпеть и сильном позыве, допустимо немного опорожнить мочевой пузырь для снятия напряжения и повторно выпить немного жидкости для достижения полного наполнения мочевого пузыря к моменту обследования.'
                },
                {
                    name: '4. УЗИ мочевого пузыря и предстательной железы (простаты) у мужчин абдоминально',
                    text: 'На полный мочевой пузырь. За 1 час до обследования выпить 1 литр негазированной воды и не мочиться.'
                },
                {
                    name: '5. ТРУЗИ (УЗИ предстательной железы ректально)',
                    text: 'За 2 часа до обследования опорожнить кишечник (сделать клизму). При отсутствии противопоказаний рекомендуется использование микроклизм.'
                },
                {
                    name: '6. УЗИ малого таза (гинекологическое)',
                    text: 'На полный мочевой пузырь. За 1 час до обследования выпить 1 литр негазированной воды и не мочиться. Обследование рекомендуется проводить с 5 по 7 день менструального цикла, либо по назначению врача. (Цикл считается с первого дня начала менструации).'
                },
                {
                    name: '7. УЗИ молочных желез',
                    text: 'Обследование рекомендуется проводить с 6 по 12 день менструального цикла. При отсутствии менструального цикла – в любой день. (Цикл считается с первого дня начала менструации).'
                },
                {
                    name: '8. УЗИ щитовидной железы',
                    text: 'Подготовки не требуется.'
                },
                {
                    name: '9. Контроль эндометрия',
                    text: 'Обследование рекомендуется проводить с 10 по 12 день менструального цикла. (Цикл считается с первого дня начала менструации).'
                },
                {
                    name: '10. УЗИ сердца',
                    text: 'Подготовки не требуется. При себе иметь «свежую» электрокардиограмму (ЭКГ)'
                },
                {
                    name: '11. УЗИ мошонки',
                    text: 'Подготовки не требуется.'
                },
            ],
            usi_services: [
                {
                    name: 'Первичный прием',
                    price: '1 700 руб'
                },
                {
                    name: 'Повторный прием',
                    price: '1 500 руб'
                },
                {
                    name: 'Биопсия кожи, мягких тканей, лимфатических узлов',
                    price: '650 руб'
                },
                {
                    name: 'Забор анализа (или материала)',
                    price: '250 руб'
                },
                {
                    name: 'Цитологическое исследование пунктатов других органов и тканей (пунктат) 4 раб дня',
                    price: '500 руб'
                },
                {
                    name: 'Цитологическое исследование соскобов и отпечатков',
                    price: '500 руб'
                },
            ],
        }
    }
}
</script>

<style>
</style>
